
const districts = ["Арбат", "Басманный", "Замоскворечье", "Красносельский", "Мещанский", "Пресненский", "Таганский", "Тверской", "Хамовники", "Якиманка", "Аэропорт", "Беговой", "Бескудниковский", "Войковский", "Восточное Дегунино", "Головинский", "Дмитровский", "Западное Дегунино", "Коптево", "Левобережный", "Молжаниновский", "Савеловский", "Сокол", "Тимирязевский", "Ховрино", "Хорошевский", "Алексеевский", "Алтуфьевский", "Бабушкинский", "Бибирево", "Бутырский", "Лианозово", "Лосиноостровский", "Марфино", "Марьина Роща", "Останкинский", "Отрадное", "Ростокино", "Свиблово", "Северное Медведково", "Северный", "Южное Медведково", "Ярославский", "Богородское", "Вешняки", "Восточное Измайлово", "Восточный", "Гольяново", "Ивановское", "Косино-Ухтомский", "Измайлово", "Новогиреево", "Новокосино", "Перово", "Преображенское", "Северное Измайлово", "Соколиная гора", "Сокольники", "Выхино-Жулебино", "Капотня", "Кузьминки", "Лефортово", "Люблино", "Марьино", "Некрасовка", "Нижегородский", "Рязанский", "Печатники", "Текстильщики", "Южнопортовый", "Братеево", "Бирюлёво Восточное", "Даниловский", "Донской", "Бирюлево Западное", "Зябликово", "Москворечье-Сабурово", "Нагатино-Садовники", "Нагатинский затон", "Нагорный", "Орехово-Борисово Северное", "Чертаново Северное", "Чертаново Центральное", "Южное Орехово-Борисово", "Южное Чертаново", "Академический", "Гагаринский", "Зюзино", "Коньково", "Котловка", "Ломоносовский", "Обручевский", "Северное Бутово", "Теплый Стан", "Черемушки", "ЮжноеБутово", "Ясенево", "Внуково", "Дорогомилово", "Крылатское", "Кунцево", "Можайский", "Ново-Переделкино", "Очаково-Матвеевское", "Проспект Вернадского", "Раменки", "Солнцево", "Тропарёво-Никулино", "Филёвский парк", "Фили-Давыдково", "Куркино",  "Митино", "Покровское-Стрешнево", "Северное Тушино", "Строгино", "Хорошево-Мневники", "Щукино", "Южное Тушино", "Матушкино", "Савелки", "Силино", "Старое Крюково", "Крюково", "Вороновское", "Киевский", "Кленовское", "Краснопахорское", "Михайлово-Ярцевское", "Новофедоровское", "Первомайское", "Роговское", "Щаповское", "Внуковское", "Воскресенское", "Десеновское", "Кокошкино", "Марушкинское", "Московский", "Мосрентген", "Рязановское", "Сосенское", "Филимонковское"];

const stations = ["Тверская", "Смоленская", "Киевская", "Кропоткинская", "Арбатская", "Полянка", "Охотный ряд", "Фрунзеская", "Тушинская", "Октяборьская", "Сретенский Бульвар", "Цветной Бульвар", "Аэропорт", "Марьина роща", "Славянский бульвар", "Новослободская", "Маяковская", "Чистые пруды", "Новые ворота", "Сокол", "Пушкинская", "Динамо", "Павелецкая", "Новокузнецкая", "Парк Культуры", "Медведково", "Александровский сад", "Белорусская", "Калужская", "Бауманская", "Боровицкая", "Площадь Революции", "Трубная", "Чкаловская", "Курская", "Университет", "Краснопресенская", "Автозаводская", "Новые черемушки", "Кунцевская", "Арбат", "Таганская", "Сухаревская", "Ленинский проспект", "Алтуфьево", "Аннино", "Пражское", "Октяборьское поле", "Нахимовский проспект", "Волокаламская", "Марьево", "Бибирева", "Отрадное", "Строгино", "Третьяковская", "Щукинская", "1905 года", "Чеховская", "ВДНХ", "Войковская", "Международная", "Серпуховская", "Кузнецкий мост", "Тургеневская", "Проспект Мира", "Тульская", "Нагатинская", "Профсоюзная", "Академическая", "Ленинский проспект", "Шаболовская", "Калужская", "Беляево", "Спортивная", "Воробьевы горы", "Проспект Вернадского", "Юго-Западная", "Выставочная", "Парк Победы", "Молодежная", "Сокол", "Водный стадион", "Речной вокзал", "Тропарёво", "Крылатское", "Беговая", "Щукинская", "Рижская", "Алексеевская", "Красносельская", "Комсомольская", "Сокольники", "Преображеская площадь", "Автозаводская", "Третьяковская", "Новокузнецкая", "Театральная", "Красные ворота", "Чеховская", "Библиотека имени Ленина", "Теплый стан", "Кунцево", "Волоколамкая", "Авиамоторная", "Добрынинская", "Мякинино", "Коньково", "Китай Город", "Кутузовская", "Цветной бульвар", "Митино", "Пятницкое шоссе", "Свиблово", "Дмитровская", "Савеловская", "Фили", "Площадь Гагарина", "Тимирязевская"];

let isGenDistcrics = false;
let isGenStantions = false;

let isOpenDistcrics = false
let isOpenStantions = false


function toogleFilters (event) {
    const className = event.target.getAttribute("area-element")
    const areaList = document.querySelector(`.${className}`);

    function createCheckBox (string) {
        const checkbox = document.createElement('label');
        checkbox.className = "checkbox";
        checkbox.innerHTML = string;
        areaList.append(checkbox);

        const input = document.createElement('input');
        input.type = "checkbox";
        checkbox.append(input);

        const checkmark = document.createElement('span');
        checkmark.className = "checkmark";
        checkbox.append(checkmark);
    }

    if (className === "filter-switch-station-list") {
        if (isGenStantions === false){
            stations.forEach( elem => createCheckBox(elem));
            isGenStantions = true;
        }
        areaList.style.transform = isOpenStantions ? "scaleY(0)" : "scaleY(1)"
        areaList.style.height = isOpenStantions ? "0em" : "15em"
        isOpenStantions = !isOpenStantions
    } else if (className === "filter-switch-district-list") {
        if (isGenDistcrics === false){
            districts.forEach( elem => createCheckBox(elem));
            isGenDistcrics = true;
        }
        areaList.style.transform = isOpenDistcrics ? "scaleY(0)" : "scaleY(1)"
        areaList.style.height = isOpenDistcrics ? "0em" : "15em"
        isOpenDistcrics = !isOpenDistcrics
    }
}


document.querySelector(".filter-switch-districts").onclick = toogleFilters;
document.querySelector(".filter-switch-stations").onclick = toogleFilters;
